import { EnumVideoPlayerQuality } from '@/video/dto/video.types'

export const HIS_VIDEOS = [
	{
		title: 'Как Помодоро 25/5 Изменил Мою Продуктивность: Почему Я Вернулся?',
		viewsCount: 1600,
		thumbnailUrl: '/uploads/thumbnails/OcKq7KqgL7g-MQ.jpg',
		slug: 'f3d594a6af3f',
		videoFileName: 'f3d594a6af3f.mp4',
		maxResolution: EnumVideoPlayerQuality['1080p'],
		description:
			'<p>💡 Личный ТГ канал - <a href="https://t.me/hardmaxchannel" target="_blank">https://t.me/hardmaxchannel</a></p><p>👍 Давайте наберем 200 лайков, и я пойму, что контент вам полезен.</p><p>В этом видео я расскажу, почему вернулся к технике Помодоро 25/5 и как она повлияла на мою продуктивность. Узнайте, как короткие перерывы между рабочими сессиями помогают фокусироваться, избегать выгорания и достигать большего за короткий срок. Делюсь своими личными наблюдениями, советами и опытом использования этой техники для улучшения эффективности в повседневной жизни.</p><p>🔥 Обучение веб разработке - <a href="https://htmllessons.io/premium" target="_blank">https://htmllessons.io/premium</a></p><p>👉 Все ссылки и информация обо мне - <a href="https://htmllessons.io/links" target="_blank">https://htmllessons.io/links</a></p><p>Подпишись на канал, для меня это важно!</p>',
		channelSlug: 'his',
		isPublic: true,
		tags: [
			'помодоро',
			'продуктивность',
			'планирование',
			'саморазвитие',
			'самодисциплина',
			'мотивация',
			'work from home',
			'productivity',
			'бизнес'
		]
	},
	{
		title: 'В какие часы лучше работать? Уникальный метод расчета',
		viewsCount: 801,
		thumbnailUrl: '/uploads/thumbnails/rYX5l8A5KyQ-MQ.jpg',
		slug: 'h33594a6af3f',
		videoFileName: 'f3d594a6af3f.mp4',
		maxResolution: EnumVideoPlayerQuality['1080p'],
		description:
			'<p>💡 Личный ТГ канал - <a href="https://t.me/hardmaxchannel" target="_blank">https://t.me/hardmaxchannel</a></p><p>👍 Давайте наберем 200 лайков, и я пойму, что контент вам полезен.</p><p>Узнайте, как определить свои оптимальные часы работы с помощью уникального метода расчета. Измеряйте температуру тела и пульс каждые 2 часа, чтобы создать график работоспособности. Планируйте важные задачи на периоды повышения температуры, а отдых - на спады. Учитывайте циркадные ритмы и распределяйте задачи в течение дня. Повысьте свою продуктивность, работая в гармонии с биологическими часами.</p><p>🔥 Обучение веб разработке - <a href="https://htmllessons.io/premium" target="_blank">https://htmllessons.io/premium</a></p><p>👉 Все ссылки и информация обо мне - <a href="https://htmllessons.io/links" target="_blank">https://htmllessons.io/links</a></p><p>Подпишись на канал, для меня это важно!</p>',
		channelSlug: 'his',
		isPublic: true,
		tags: [
			'продуктивность',
			'саморазвитие',
			'самодисциплина',
			'мотивация',
			'биоритмы',
			'сон',
			'режим дня',
			'work from home',
			'productivity',
			'бизнес'
		]
	},
	{
		title: 'Хобби vs. быстрый дофамин: путь к долгосрочному счастью',
		viewsCount: 1400,
		thumbnailUrl: '/uploads/thumbnails/EA8d31RSX8g-MQ.jpg',
		slug: 'EA8d31RSX8g',
		videoFileName: 'f3d594a6af3f.mp4',
		maxResolution: EnumVideoPlayerQuality['1080p'],
		description:
			'<p>💡 Личный ТГ канал - <a href="https://t.me/hardmaxchannel" target="_blank">https://t.me/hardmaxchannel</a></p><p>👍 Давайте наберем 200 лайков, и я пойму, что контент вам полезен.</p><p>В этом соло-подкасте разберем, почему глубокое увлечение важнее мимолетных удовольствий? Узнайте, как хобби влияет на качество жизни и помогает достичь истинного удовлетворения. Разберемся в механизмах работы дофамина и его влиянии на наше поведение. Научимся различать качественный и некачественный досуг. Откройте для себя путь к долгосрочному счастью через развитие настоящих интересов и талантов.</p><p>🔥 Обучение веб разработке - <a href="https://htmllessons.io/premium" target="_blank">https://htmllessons.io/premium</a></p><p>👉 Все ссылки и информация обо мне - <a href="https://htmllessons.io/links" target="_blank">https://htmllessons.io/links</a></p><p>Подпишись на канал, для меня это важно!</p>',
		channelSlug: 'his',
		isPublic: true,
		tags: [
			'саморазвитие',
			'самодисциплина',
			'мотивация',
			'дофамин',
			'счастье',
			'удовольствие',
			'хобби',
			'work from home',
			'productivity'
		]
	}
]
